const placeType = function (type) {
  type = (type) ? type.toUpperCase() : '';
  let t = 'Коттеджный посёлок';
  switch (type) {
    case 'СНТ':
      t = 'Садоводческое некоммерческое товарищество';
      break;

    case 'ДНТ':
      t = 'Дачное некоммерческое товарищество';
      break;

    case 'ДНП':
      t = 'Дачное некоммерческое партнерство';
      break;

    case 'СТ':
      t = 'Садоводческое товарищество';
      break;

    case 'ЖК':
      t = 'Жилой комплекс';
      break;

    case 'ДП':
      t = 'Дачный поселок';
      break;

    case 'ДПК': //дачный потребительский кооператив
      t = 'Дачный поселок';
      break;

    case 'ДСК': //дачный садоводческий кооператив
      t = 'Дачный поселок';
      break;

    case 'СПК': //садоводческий потребительский кооперати
      t = 'Садоводческий кооператив';
      break;
  }

  return t;

}

module.exports = placeType;